Revit 2027 API
LoadedFamilyIntegrityCheck Methods
The LoadedFamilyIntegrityCheck type exposes the following members.
Methods
Name | Description
CheckAllFamilies |  Check that all families loaded in the host document have their content documents.
CheckAllFamiliesSlow |  Check integrity of content documents of all families loaded in the host document.
CheckFamily |  Check that the loaded family has its content document.
Top
See Also
Reference
LoadedFamilyIntegrityCheck Class
Autodesk.Revit.DB Namespace